ROR/codigo_facilito_curso_rails-master/blog/app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles`
---
  def index
    @articles = Article.all # Las variables de clase inician con una @

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
  def show
    @article = Article.find(params[:id]) # params = Es un hash con todos los elementos que se mandan

INSERT INTO `articles` (`created_at`, `updated_at`, `title`, `body`) VALUES ('2016-11-02 02:29:14', '2016-11-02 02:29:14', 'Tercer Post', 'Este es el tercer post.')
---
  def create
    @article = Article.new(title: params[:article][:title],
                           body: params[:article][:body])

    if @article.save