ROR/codigo_facilito_curso_rails-master/blog/app/views/articles/index.html.erb

            <small class="text-muted">
              <%=
                date = article.created_at
---
INSERT INTO `articles` (`created_at`, `updated_at`, `title`, `body`) VALUES ('2016-11-02 04:26:40', '2016-11-02 04:26:40', 'Cuarto post', 'Este es el cuarto post de prueba.')